/**
 * Task #13.
 * 
 * Определить класс autoOwnerDirectory (каталог автовладельцев),
 *  хранящий информацию об автовладельцах и номерах их автомобилей
 *   и реализующий следующий набор функций:
 *   
 *   • добавление новой записи в каталог;
     • удаление записи из каталога;
     • редактирование записи в каталоге;
	 • поиск фамилии автовладельца по сочетанию цифр и букв в номере автомобиля;
	 • вывод записей каталога, отсортированных по номерам.
	 
	 Информацию об автовладельцах и номерах их автомобилей 
	 внутри класса хранить в виде мапы. Подумайте, 
	 что должно быть ключем, а что значением. 
	 Предусмотрите ситуацию, когда у одного автовладельца 
	 может быть несколько автомобилей.
/**
 * @author Yakov Medvedev
 *
 */
package task_from_teacher_13;