/**
 *  Построить три класса (базовый и 2 потомка),
 *  описывающих некоторых работников с почасовой оплатой (один из потомков)
 *  и фиксированной оплатой (второй потомок).
 *  Описать в базовом классе абстрактный метод для расчета среднемесячной заработной платы. 
 *  Для «повременщиков» формула для расчета такова: 
 *  «среднемесячная заработная плата = 20.8 * 8 * почасовую ставку», 
 *  для работников с фиксированной оплатой 
 *  «среднемесячная заработная плата = фиксированной месячной оплате».
    a) Упорядочить всю последовательность работников по убыванию среднемесячного заработка. 
    При совпадении зарплаты – упорядочивать данные по алфавиту по имени. 
    Вывести идентификатор работника, имя и среднемесячный заработок для всех элементов списка.
    b) Вывести первые 5 имен работников из полученного в пункте а) списка.
    c) Вывести последние 3 идентификатора работников из полученного в пункте а) списка.
 */
/**
 * @author Yakov Medvedev
 *
 */
package task_from_teacher_11;