/**
 * 
 * Task 14. Calculator. Episode I.
 *  
 * 	Создаем программу калькулятор. 
 * Пользователь вводит с клавиатуры строку, 
 * содержащую математическое выражение. 
 * Программа должна разобрать введенную строку
 * и вернуть результат. 
 * Предусмотреть обработку всех 
 * возможных исключительных ситуаций 
 * (строка введена в неверном формате, деление на 0, переполнение). 
 * Ограничения по числам, с которыми работаем Integer.MIN_VALUE .. Integer.MAX_VALUE. 
 * Дробные числа поддерживаются до третьего знака. 
 * Поддерживаем пока операции сложения, вычитания, умножения и деления.
 * В выражении могут быть несколько операций. 
 * Считаем их согласно приоритетам (сначала умножение и деление, потом - сложение и вычитание). 
 * В качестве десятичного знака используем, пока что, точку.
 *   
 */
/**
 * @author Yakov Medvedev
 *
 */
package task_from_teacher_14;